# Pandas DataFrame practical

## CSV / Excel sheet --> DataFrame

Upload the Excel sheet "sample_sales.xlsx" to your GC Notebook (either by uploading the file or by mounting your Google Drive)

In [9]:
# enter code here (if necessary)
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

Create a dataframe **`df1`** from the first sheet of the "sample_sales.xlsx" Excel file.

In [29]:
# enter code here
import pandas as pd

file_path = 'sample_sales.xlsx'

df1 = pd.read_excel(file_path, sheet_name="Sample_Sales_1")
df1.head()

                              Region  ... Total Profit
0                             Europe  ...            ~
1              Australia and Oceania  ...       951410
2                                  ~  ...      19525.8
3  Central America and the Caribbean  ...       248406
4                             Europe  ...            ~

[5 rows x 7 columns]

Create a dataframe **`df2`** from the second sheet of the Excel file. 
* Note that this dataset does not have any headings.
* Add the same headings to this dataframe as in the first sheet: 

"Region", "Country", "Item Type", "Order Priority", "Order Date", "Total Cost", "Total Profit"

In [57]:
# enter code here
header_names = ["Region", "Country", "Item Type", "Order Priority", "Order Date", "Total Cost", "Total Profit"]
df2 = pd.read_excel(file_path, sheet_name="Sample_Sales_2", header=None, names=header_names)
df2.head()

                         Region  Country  ...  Total Cost Total Profit
0                        Europe   Monaco  ...  1373243.88    825738.04
1         Australia and Oceania   Samoa   ...  2542187.82   1678540.98
2                        Europe    Spain  ...  2267963.02    747939.49
3  Middle East and North Africa  Lebanon  ...   282562.56    579000.96
4  Middle East and North Africa     Iran  ...  1708748.37   1128242.43

[5 rows x 7 columns]

Create a dataframe **`df3`** from the third sheet of the Excel file.
* Note that you will need to skip the first few lines

In [31]:
# enter code here
df3 = pd.read_excel(file_path, sheet_name="Sample_Sales_3", skiprows=4)
df3.head()

                              Region     Country  ...  Total Cost Total Profit
0       Middle East and North Africa  Azerbaijan  ...  1060944.16    255151.25
1                             Europe     Romania  ...  2082940.30   1375311.70
2  Central America and the Caribbean   Nicaragua  ...   259279.24    127722.96
3                 Sub-Saharan Africa        Mali  ...    31825.92     65214.72
4                               Asia    Malaysia  ...    43367.64     15103.47

[5 rows x 7 columns]

Create a dataframe **`df_concat_13`** that concatenates the dataframes **`df1`** and **`df3`** on the row axis.

NB: remember to reset your index!

In [32]:
# enter code here
df_concat_13 = pd.concat([df1, df3], axis = 0) # rows are axis = 0, columns are axis = 1	
df_concat_13 = df_concat_13.reset_index()
df_concat_13.head()

   index                             Region  ...  Total Cost Total Profit
0      0                             Europe  ...   933903.84            ~
1      1              Australia and Oceania  ...  1582243.50       951410
2      2                                  ~  ...    56065.84      19525.8
3      3  Central America and the Caribbean  ...   328376.44       248406
4      4                             Europe  ...   933903.84            ~

[5 rows x 8 columns]

## Replacing and removing

For dataframe **`df1`**, column name "Order Priority":
* replace "H" with "High"
* replace "M" with "Medium"
* replace "L" with "Low"

(Keep the dataframe name **`df1`**)

In [36]:
# Enter code here
df1['Order Priority'] = df1['Order Priority'].replace(['H','M','L'],['High','Medium','Low'])
df1.head()

                              Region  ... Total Profit
0                             Europe  ...            ~
1              Australia and Oceania  ...       951410
2                                  ~  ...      19525.8
3  Central America and the Caribbean  ...       248406
4                             Europe  ...            ~

[5 rows x 7 columns]

For dataframe **`df1`**, replace all entries containing '~' with NaN values.

NB: remember to import the numpy library!

In [38]:
# Enter code here
import numpy as np

df1 = df1.replace('~', np.nan)
df1.head()

                              Region  ... Total Profit
0                             Europe  ...          NaN
1              Australia and Oceania  ...    951410.50
2                                NaN  ...     19525.82
3  Central America and the Caribbean  ...    248406.36
4                             Europe  ...          NaN

[5 rows x 7 columns]

For dataframe **`df1`**, remove all rows in the dataframe where there is a "C" in the "Order Priority" column

NB: remember to reset your index!

In [40]:
# Enter code here
df1 = df1[~df1['Order Priority'].isin(['C'])]

df1 = df1.reset_index()
df1.head()

   index                 Region Country  ... Order Date  Total Cost Total Profit
0      0                 Europe  Russia  ... 2014-05-02   933903.84          NaN
1      1  Australia and Oceania  Tuvalu  ... 2010-05-28  1582243.50     951410.5
2      4                 Europe  Russia  ... 2014-05-02   933903.84          NaN
3      6     Sub-Saharan Africa  Rwanda  ... 2013-02-01  2657347.52     639077.5
4      8     Sub-Saharan Africa  Angola  ... 2011-04-23  2104134.98          NaN

[5 rows x 8 columns]

Create a dataframe **`df_cereal`**. This dataframe should only contain the rows of **`df1`** where the "Item Type" entry is "Cereal"
* remember to reset the index

In [43]:
# Enter code here
df_cereal = df1[df1['Item Type'].isin(['Cereal'])]
df_cereal = df_cereal.reset_index()

df_cereal.head()

   level_0  index              Region  ... Order Date Total Cost Total Profit
0        8     12  Sub-Saharan Africa  ... 2014-04-18  772106.23    584073.87
1       39     48  Sub-Saharan Africa  ... 2012-06-07  247921.87    187545.03

[2 rows x 9 columns]

Remove the column "Total Cost" and "Total Profit" in dataframe **`df1`**.

(Keep the dataframe name **`df1`**)

In [49]:
# Enter code here
df1 = df1.drop(['Total Cost', 'Total Profit'], axis=1)
df1.head()

   index                 Region  ... Order Priority Order Date
0      0                 Europe  ...            Low 2014-05-02
1      1  Australia and Oceania  ...           High 2010-05-28
2      4                 Europe  ...            Low 2014-05-02
3      6     Sub-Saharan Africa  ...            Low 2013-02-01
4      8     Sub-Saharan Africa  ...         Medium 2011-04-23

[5 rows x 6 columns]

Some of the entries in **`df1`** are duplicates.
If the same "Country" and "Item type" entries appear in more than one row, only keep the **`last`** entry and remove the rest of the duplicates. Keep the name of the dataframe **`df1`**
* remember to reset the index

In [52]:
# Enter code here
df1 = df1.drop_duplicates(subset=['Country', 'Item Type'], keep = "last") #--- keep = first / last / False
df1 = df1.reset_index()
df1.head()

   level_0  index  ... Order Priority Order Date
0        1      1  ...           High 2010-05-28
1        2      4  ...            Low 2014-05-02
2        3      6  ...            Low 2013-02-01
3        5      9  ...         Medium 2011-04-23
4        6     10  ...           High 2012-07-17

[5 rows x 7 columns]

## Dates

Consider dataframe **`df2`**. 
Change the Order Date column to a pandas datetime, with the format: year-month-day

(Keep the dataframe name **`df2`**)

* remember to add code that would allow for incorrect dates to be displayed as "NaT"

In [58]:
# Enter code here
df2['Order Date'] = pd.to_datetime(df2['Order Date'], format="%Y-%m-%d", errors='coerce')
df2.head()

                         Region  Country  ...  Total Cost Total Profit
0                        Europe   Monaco  ...  1373243.88    825738.04
1         Australia and Oceania   Samoa   ...  2542187.82   1678540.98
2                        Europe    Spain  ...  2267963.02    747939.49
3  Middle East and North Africa  Lebanon  ...   282562.56    579000.96
4  Middle East and North Africa     Iran  ...  1708748.37   1128242.43

[5 rows x 7 columns]

Remove all the rows in **`df2`** that contain NaT values in your "Order Date" column.

(Keep the dataframe name **df2**)

* NB: since you removed some rows, remember to reset your index!

In [61]:
# Enter code here
df2 = df2[df2['Order Date'].notnull()]

df2 = df2.reset_index()

df2.head()

   index                 Region Country  ... Order Date  Total Cost Total Profit
0      0                 Europe  Monaco  ... 2012-05-29  1373243.88    825738.04
1      1  Australia and Oceania  Samoa   ... 2013-07-20  2542187.82   1678540.98
2      2                 Europe   Spain  ... 2012-10-21  2267963.02    747939.49
3      5     Sub-Saharan Africa  Zambia  ... 2011-01-04   398042.40    225246.90
4      6     Sub-Saharan Africa   Kenya  ... 2012-03-18   587135.01    407630.41

[5 rows x 8 columns]

## Dataframe --> CSV / Excel sheet

Write dataframe df1 to a csv named 'dataframe_1' and write it to your Drive

In [62]:
df1.to_csv('drive/MyDrive/dataframe_1.csv')

Write dataframe df2 to an excel sheet named 'dataframe_2' and write it to your Drive

In [63]:
df2.to_excel('drive/MyDrive/dataframe_2.xlsx')